[
  {
    "name": "What's for Dinner?",
    "live": "https://whats-for-dinner.herokuapp.com",
    "git": "https://github.com/marotella/whats-for-dinner-frontend",
    "image": "/dinner.png",
    "type": "Solo",
    "description": "This Flask-React application was created to dicsover new recipes using the ingredients you have on hand, and reduce food waste. This application deepended my understanding of React, and allowed me to use my knowledge of Python. It uses React to handle user authentication, and has strong error handling.",
    "technologies": "HTML/CSS, TailwindCSS, JavaScript, Python, Flask, React, SQL, Heroku"
  },
  {
    "name": "JP Morgan Software Engineering Job Simulation with Forage",
    "live": "https://github.com/marotella/forage-jpmc-swe-task-3",
    "git": "https://github.com/marotella/forage-jpmc-swe-task-3",
    "image": "/portfolio-frontend-1/public/jpmorganforage.jpeg",
    "type": "Solo",
    "description": "Developed a stock trading dashboard. Built in Python, React, and TypeScript and utilizing the Perspective open source project, created data visualizations for complex financial data analysis.",
    "technologies": "TypeScript, JavaScript, Python, React"
  },
  {
    "name": "Cave-a-vin",
    "live": "https://cave-a-vin-frontend.herokuapp.com/",
    "git": "https://github.com/marotella/cave-a-vin-frontend/tree/main",
    "image": "/caveavin.png",
    "type": "Group",
    "description": "This MERN application developed in collaboration with a team, designed to enhance the user experience in discovering new wines. As my inaugural collaborative project using React, this endeavor not only expanded my proficiency in GitHub, Git, and integrating external APIs but also allowed me to learn invaluable insights from my colleagues. This experience has fueled my enthusiasm for future team projects, and I'm excited to embark on more collaborative endeavors in the future.",
    "technologies": "HTML/CSS, Bootstrap, JavaScript, Express, React, MongoDB, Heroku"
  },
  {
    "name": "Relay",
    "live": "https://relaycrudapp.herokuapp.com",
    "git": "https://github.com/marotella/relayCRUDApp",
    "image": "/relayicon.png",
    "type": "Solo",
    "description": "This project is an application I developed to support team project management. Relay allowed me to delve deeper into Agile and Scrum methodologies while sharpening my skills in designing routes, components, and utilizing EJS. Explore this project to witness my expertise in creating efficient and intuitive applications tailored for seamless project management.",
    "technologies": "HTML/CSS, JavaScript, Express, Heroku"
  },
  {
    "name": "Two Player Project",
    "live": "https://app.herokuapp.com/whatever",
    "git": "https://github.com/marotella/twoPlayerProject",
    "image": "/vanDamme.png",
    "type": "Solo",
    "description": "Embark on a thrilling journey through the golden era of early nineties action stars with my two-player game. This initial project of mine showcases my skills around DOM manipulation, Javascript, and Vanilla CSS, as well as the tremendous growth I've achieved in a short span of time. Witness firsthand how my skills have evolved by comparing this game to my more recent projects, and experience the dynamic and engaging web experiences I can create.",
    "technologies": "HTML/CSS, JavaScript"
  }
]